recordings/webstaurantstoreOUTLET-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: webstaurantstoreOUTLET-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: webstaurantstoreOUTLET-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  webstaurantstoreOUTLET-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1920,886)
      - go(https://www.webstaurantstore.com/outlet/178A35RHC/67831.html)
      - clickByXPath(//*[text() = "Outlet"])
    - label: Product-page
      actions:
      - clickByXPath(//img[contains(@src,'https://www.webstaurantstore.com/images/outlet/medium/67397/357491.jpg')])

  webstaurantstoreOUTLET-Http:
    headers:
      sec-ch-ua: '"Brave";v="123", "Not:A-Brand";v="8", "Chromium";v="123"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/123.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8
      Sec-GPC: '1'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://www.webstaurantstore.com/outlet.html'
            method: GET
            label: 'https://www.webstaurantstore.com/outlet.html'
            think-time: 0ms
            headers: {}
          - url: 'https://www.google.com/recaptcha/api2/anchor'
            method: GET
            label: 'https://www.google.com/recaptcha/api2/anchor'
            headers: {}
            body:
              ar: '1'
              k: 6LcMB7EUAAAAAIBgYhbNBrCNyKHlQtMgVYTjpT8V
              co: aHR0cHM6Ly93d3cud2Vic3RhdXJhbnRzdG9yZS5jb206NDQz
              hl: en
              v: rz4DvU-cY2JYCwHSTck0_qm-
              size: invisible
              cb: npxgin7eso0y
      - transaction: Product-page
        force-parent-sample: false
        do:
          - url: 'https://www.webstaurantstore.com/outlet/600S13624SB/67397.html'
            method: GET
            label: 'https://www.webstaurantstore.com/outlet/600S13624SB/67397.html'
            think-time: 25946ms
            headers: {}
          - url: 'https://www.google.com/recaptcha/api2/anchor'
            method: GET
            label: 'https://www.google.com/recaptcha/api2/anchor'
            headers: {}
            body:
              ar: '1'
              k: 6LcMB7EUAAAAAIBgYhbNBrCNyKHlQtMgVYTjpT8V
              co: aHR0cHM6Ly93d3cud2Vic3RhdXJhbnRzdG9yZS5jb206NDQz
              hl: en
              v: rz4DvU-cY2JYCwHSTck0_qm-
              size: invisible
              cb: q4pecqgt0679